# без использования collections, написать программу которая будет создавать словарь
# для подсчитывания колличества вхождений каждой буквы в текст введенный с клавиатуры
sim = input('символ: ')

print(input().count(sim))