# без использования collections, написать программу которая будет создавать словарь
# для подсчитывания колличества вхождений каждой буквы в текст введенный с клавиатуры
sim = input('символ: ')
some_dict = {1: input('1: '), 2: input('2: ')}
some_dict.values()
print(sum )