#Код Морзе для представления цифр и букв использует тире и точки. Напишите
#функцию для кодирования текстового сообщения в соответствии с кодом Морзе. (словари в помощь)

morse = dict((('A', '•—'), ('B', '—•••'), ('C', '—•—•'), ('D', '—••'), ('E', '•'), ('F', '••—•'), ('G', '——•'),
              ('H', '••••'), ('I', '••'), ('J', '•———'), ('K', '—•—'), ('L', '•—••'), ('M', '——'), ('N', '—•'),
              ('O', '———'), ('P', '•——•'), ('Q', '——•—'), ('R', '•—•'), ('S', '•••'), ('T', '—'), ('U', '••—'),
              ('V', '•••—'), ('W', '•——'), ('X', '—••—'), ('Y', '—•——'), ('Z', '——••'), ('1', '•————'), ('2', '••———'),
              ('3', '•••——'), ('4', '••••—'), ('5', '•••••'), ('6', '—••••'), ('7', '——•••'), ('8', '———••'),
              ('9', '————•'), ('0', '—————')))

def Morse(s):
    a = ''
    for i in s.upper():
        if i in morse.keys():
            a += morse[i] + ' '
        if i == ' ':
            a += '    '
    return a

def get_key(val, dct):
    for key, value in dct.items():
        if val == value:
            return key
a = input()
print(Morse(a))



